{
    "version": 1,
    "title": "Introducing The NEXT Engine",
    "time": 1757029181001,
    "author": "qwewqa#590353",
    "description": "The Next SEKAI engine is a new Sonolus engine incorporating features from both Nanashi.'s Chart Cyanvas engine and\nHyeon2/현이's Sekai Rush engine. It combines its own unique features and improvements, the extended note types from Chart\nCyanvas, and the visual improvements from Sekai Rush.\n\nEXTENDED CHART FEATURES\n\nExtended chart features are supported, including those from Chart Cyanvas and some new ones:\n\n- Multiple Timescale Groups: Notes can belong to different timescale groups, allowing them to move at different speeds.\n- More Guide Colors: Guides can take on any of 8 different colors.\n- Damage Notes: Notes that must be avoided, and count as a miss if touched while crossing the judgement line.\n- (Next SEKAI exclusive) Downward Flicks: Flicks can be directed downwards, making new chart patterns possible.\n- (Next SEKAI exclusive) Enhanced Slides: New charting options for slides, including changing timescale mid-slide.\n- (Next SEKAI exclusive) Fake Notes: Greater flexibility in charts to use notes for visual effects without affecting gameplay.\n\nVISUAL IMPROVEMENTS\n\nMany of the visual improvements from Sekai Rush have been brought over including:\n\n- Improved note slot and slot glow effects.\n- Improved note particle effects.\n\nNEW OPTIONS\n\nSeveral new options have been added for greater customization:\n\n- Slide & Guide Quality: Adjust the quality of slides and guides for better performance or improved visual quality.\n- Note Margin: Shrink note widths to make side-by-side notes easier to read.\n- Alternative Approach Curve: Use an alternative approach curve for notes that is closer to games like D4DJ and Arcaea.\n- Disable Timescale: Turn off timescale changes to practice rhythms in timescale-heavy charts.\n\nSOURCE CODE\n\nThe Next SEKAI engine is open source and available on GitHub at https://github.com/Next-SEKAI/sonolus-next-sekai-engine."
}